Unidad07_AlmacenamientoExterno/Practicas/Tarea_HablandoConElSistema.tex
% Created 2019-12-13 vie 09:45
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas}
\date{\today}
\title{UD07 - Hablando con el Sistema}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Descripción}
\label{sec-1}

En la empresa \emph{Soluciones Eficientes de Alta Disponibilidad}, nos han pedido el
mantenimiento de una serie de equipos a los que hemos instalado un Sistema
GNU/Linux para posteriormente (\emph{semana que viene}) configurar un RAID.

Previo a la instalación vamos a elaborar una serie de comandos que nos van a
servir para mas tarde poder realizar el \emph{mantenimiento} de dichos sistemas. 

\section{Registros del Sistema}
\label{sec-2}

Escribe los comandos necesarios para realizar las siguientes acciones:

\subsection{Ejercicio 01}
\label{sec-2-1}

¿Qué comando nos permitirá saber cuando ha sido la última vez que arrancó la
máquina?

\subsection{Ejercicio 02}
\label{sec-2-2}

Obtén tu IP y velocidad del enlace en la red LOCAL.

\subsection{Ejercicio 03}
\label{sec-2-3}

Sistema Operativo Instalado

\subsection{Ejercicio 04}
\label{sec-2-4}

Número de particiones de un disco duro dado (/dev/sda)

\subsection{Ejercicio 05}
\label{sec-2-5}

Tamaño de la partición montada en \verb~/~.

\subsection{Ejercicio 06}
\label{sec-2-6}

Carpeta de \verb~/~ que ocupa \emph{más} espacio.

\subsection{Ejercicio 07}
\label{sec-2-7}

Carpeta de \verb~/~ que ocupa \emph{menos} espacio.

\subsection{Ejercicio 08}
\label{sec-2-8}

La 2ª Carpeta de \verb~/usr/share~ que ocupa \emph{más} espacio.

\subsection{Ejercicio 09}
\label{sec-2-9}

La antepenúltima carpeta que ocupa \emph{menos} espacio en \verb~/usr/lib~.

\subsection{Ejercicio 10}
\label{sec-2-10}

Cuantas veces ha sido conectado un USB en el equipo desde que arrancó.

\subsection{Ejercicio 11}
\label{sec-2-11}

Cuál es el volumen de sonido del altavoz principal.

\subsection{Ejercicio 12}
\label{sec-2-12}

Cuantas pantallas hay conectadas y a qué resolución.

\section{Entrega}
\label{sec-3}

En un \emph{PDF} copia el enunciado y cada uno de los comandos que se deben
ejecutar para resolver el \emph{problema}.
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}
